# ðŸ§¼ Data Cleaning: Store Sales Dataset

In [2]:
import pandas as pd

# Load the dataset
df = pd.read_csv('store_sales_dirty_data.csv')

# Preview the first few rows
df.head()

   ID Product Name   Category  Quantity  Unit Price   Sale Date    Store
0   1         Milk  Household       NaN         NaN  2023-07-13  Store B
1   2         Eggs        NaN      10.0         2.0  2023-07-10  Store A
2   3          NaN      Dairy       NaN        -2.5  01.07.2023  Store A
3   4       Apples    Produce      10.0         NaN  02.07.2023  Store A
4   5         Milk      Dairy       3.0         1.5         NaN  Store C

## Step 2: Explore the Structure and Data Types

In [2]:
df.info()
df.describe(include='all')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            30 non-null     int64
 1   Product Name  27 non-null     object
 2   Category      24 non-null     object
 3   Quantity      21 non-null     float64
 4   Unit Price    20 non-null     float64
 5   Sale Date     22 non-null     object
 6   Store         30 non-null     object
dtypes: float64(2), int64(1), object(4)
memory usage: 1.8+ KB

,ID,Product Name,Category,Quantity,Unit Price,Sale Date,Store
count,30.000000,27,24,21.000000,20.000000,22,30
unique,NaN,7,5,NaN,NaN,18,3
top,NaN,Eggs,Dairy,NaN,NaN,2023/07/15,Store A
freq,NaN,6,8,NaN,NaN,4,15
mean,15.500000,NaN,NaN,6.142857,1.725000,NaN,NaN
std,8.803408,NaN,NaN,4.003570,1.875921,NaN,NaN
min,1.000000,NaN,NaN,0.000000,-2.500000,NaN,NaN
25%,8.250000,NaN,NaN,3.000000,1.500000,NaN,NaN
50%,15.500000,NaN,NaN,5.000000,1.750000,NaN,NaN
75%,22.750000,NaN,NaN,10.000000,3.750000,NaN,NaN
max,30.000000,NaN,NaN,10.000000,3.750000,NaN,NaN

## Step 3: Handle Missing Values

In [1]:
df.replace(['', 'NaN'], pd.NA, inplace=True)

# Drop rows with missing product name or store
df.dropna(subset=['Product Name', 'Store'], inplace=True)

# Convert Quantity and Unit Price to numeric
df['Quantity'] = pd.to_numeric(df['Quantity'], errors='coerce')
df['Unit Price'] = pd.to_numeric(df['Unit Price'], errors='coerce')

# Fill missing values with median
df['Quantity'] = df['Quantity'].fillna(df['Quantity'].median())
df['Unit Price'] = df['Unit Price'].fillna(df['Unit Price'].median())

NameError: name 'df' is not defined

## Step 4: Clean the 'Sale Date' Column

In [6]:
df['Sale Date'] = pd.to_datetime(df['Sale Date'], errors='coerce', dayfirst=True)

# Drop rows with invalid dates
df.dropna(subset=['Sale Date'], inplace=True)

## Step 5: Remove Invalid or Suspicious Values

In [1]:
df = df[(df['Unit Price'] > 0) & (df['Quantity'] > 0)]

NameError: name 'df' is not defined

## Step 6: Remove Duplicates

In [8]:
df.drop_duplicates(inplace=True)

## Step 7: Final Check and Save

In [9]:
df.info()
df.head()

# Save cleaned file
df.to_csv('store_sales_cleaned.csv', index=False)

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 0 to 28
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            5 non-null      int64
 1   Product Name  5 non-null      object
 2   Category      3 non-null      object
 3   Quantity      5 non-null      float64
 4   Unit Price    5 non-null      float64
 5   Sale Date     5 non-null      datetime64[ns]
 6   Store         5 non-null      object
dtypes: datetime64[ns](1), float64(2), int64(1), object(3)
memory usage: 320.0+ bytes

## Optional: Add Total Sale Column

In [10]:
df['Total Sale'] = df['Quantity'] * df['Unit Price']
df.head()

,ID,Product Name,Category,Quantity,Unit Price,Sale Date,Store,Total Sale
0,1,Milk,Household,7.5,2.00,2023-07-13,Store B,15.00
1,2,Eggs,NaN,10.0,2.00,2023-07-10,Store A,20.00
7,8,Cheese,Household,7.5,2.00,2023-07-23,Store C,15.00
10,11,Bread,Household,1.0,3.75,2023-07-08,Store A,3.75
28,29,Cheese,NaN,3.0,2.00,2023-07-15,Store B,6.00